Roland665/MiniCar_Guet/MiniCar_V2/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C123/TM4C123GH6ZXR.svd
        <register>
          <name>TXFIFOSZ</name>
          <description>USB Transmit Dynamic FIFO Sizing</description>
          <addressOffset>0x00000062</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXFIFOSZ_SIZE</name>
              <description>Max Packet Size</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_8</name>
                  <description>8</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_16</name>
                  <description>16</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_32</name>
                  <description>32</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_64</name>
                  <description>64</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_128</name>
                  <description>128</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_256</name>
                  <description>256</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_512</name>
                  <description>512</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_1024</name>
                  <description>1024</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_2048</name>
                  <description>2048</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_TXFIFOSZ_DPB</name>
              <description>Double Packet Buffer Support</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFIFOSZ</name>
          <description>USB Receive Dynamic FIFO Sizing</description>
          <addressOffset>0x00000063</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXFIFOSZ_SIZE</name>
              <description>Max Packet Size</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_8</name>
                  <description>8</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_16</name>
                  <description>16</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_32</name>
                  <description>32</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_64</name>
                  <description>64</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_128</name>
                  <description>128</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_256</name>
                  <description>256</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_512</name>
                  <description>512</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_1024</name>
                  <description>1024</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_2048</name>
                  <description>2048</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_RXFIFOSZ_DPB</name>
              <description>Double Packet Buffer Support</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFIFOADD</name>
          <description>USB Transmit FIFO Start Address</description>
          <addressOffset>0x00000064</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_TXFIFOADD_ADDR</name>
              <description>Transmit/Receive Start Address</description>
              <bitRange>[8:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFIFOADD</name>
          <description>USB Receive FIFO Start Address</description>
          <addressOffset>0x00000066</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXFIFOADD_ADDR</name>
              <description>Transmit/Receive Start Address</description>
              <bitRange>[8:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CONTIM</name>
          <description>USB Connect Timing</description>
          <addressOffset>0x0000007A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_CONTIM_WTID</name>
              <description>Wait ID</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>USB_CONTIM_WTCON</name>
              <description>Connect Wait</description>
              <bitRange>[7:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>VPLEN</name>
          <description>USB OTG VBUS Pulse Timing</description>
          <addressOffset>0x0000007B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_VPLEN_VPLEN</name>
              <description>VBUS Pulse Length</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FSEOF</name>
          <description>USB Full-Speed Last Transaction to End of Frame Timing</description>
          <addressOffset>0x0000007D</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_FSEOF_FSEOFG</name>
              <description>Full-Speed End-of-Frame Gap</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LSEOF</name>
          <description>USB Low-Speed Last Transaction to End of Frame Timing</description>
          <addressOffset>0x0000007E</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_LSEOF_LSEOFG</name>
              <description>Low-Speed End-of-Frame Gap</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFUNCADDR0</name>
          <description>USB Transmit Functional Address Endpoint 0</description>
          <addressOffset>0x00000080</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXFUNCADDR0_ADDR</name>
              <description>Device Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBADDR0</name>
          <description>USB Transmit Hub Address Endpoint 0</description>
          <addressOffset>0x00000082</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBADDR0_ADDR</name>
              <description>Hub Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBPORT0</name>
          <description>USB Transmit Hub Port Endpoint 0</description>
          <addressOffset>0x00000083</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBPORT0_PORT</name>
              <description>Hub Port</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFUNCADDR1</name>
          <description>USB Transmit Functional Address Endpoint 1</description>
          <addressOffset>0x00000088</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXFUNCADDR1_ADDR</name>
              <description>Device Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBADDR1</name>
          <description>USB Transmit Hub Address Endpoint 1</description>
          <addressOffset>0x0000008A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBADDR1_ADDR</name>
              <description>Hub Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBPORT1</name>
          <description>USB Transmit Hub Port Endpoint 1</description>
          <addressOffset>0x0000008B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBPORT1_PORT</name>
              <description>Hub Port</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFUNCADDR1</name>
          <description>USB Receive Functional Address Endpoint 1</description>
          <addressOffset>0x0000008C</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXFUNCADDR1_ADDR</name>
              <description>Device Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBADDR1</name>
          <description>USB Receive Hub Address Endpoint 1</description>
          <addressOffset>0x0000008E</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBADDR1_ADDR</name>
              <description>Hub Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBPORT1</name>
          <description>USB Receive Hub Port Endpoint 1</description>
          <addressOffset>0x0000008F</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBPORT1_PORT</name>
              <description>Hub Port</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFUNCADDR2</name>
          <description>USB Transmit Functional Address Endpoint 2</description>
          <addressOffset>0x00000090</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXFUNCADDR2_ADDR</name>
              <description>Device Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBADDR2</name>
          <description>USB Transmit Hub Address Endpoint 2</description>
          <addressOffset>0x00000092</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBADDR2_ADDR</name>
              <description>Hub Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBPORT2</name>
          <description>USB Transmit Hub Port Endpoint 2</description>
          <addressOffset>0x00000093</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBPORT2_PORT</name>
              <description>Hub Port</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFUNCADDR2</name>
          <description>USB Receive Functional Address Endpoint 2</description>
          <addressOffset>0x00000094</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXFUNCADDR2_ADDR</name>
              <description>Device Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBADDR2</name>
          <description>USB Receive Hub Address Endpoint 2</description>
          <addressOffset>0x00000096</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBADDR2_ADDR</name>
              <description>Hub Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBPORT2</name>
          <description>USB Receive Hub Port Endpoint 2</description>
          <addressOffset>0x00000097</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBPORT2_PORT</name>
              <description>Hub Port</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFUNCADDR3</name>
          <description>USB Transmit Functional Address Endpoint 3</description>
          <addressOffset>0x00000098</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXFUNCADDR3_ADDR</name>
              <description>Device Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBADDR3</name>
          <description>USB Transmit Hub Address Endpoint 3</description>
          <addressOffset>0x0000009A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBADDR3_ADDR</name>
              <description>Hub Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBPORT3</name>
          <description>USB Transmit Hub Port Endpoint 3</description>
          <addressOffset>0x0000009B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBPORT3_PORT</name>
              <description>Hub Port</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFUNCADDR3</name>
          <description>USB Receive Functional Address Endpoint 3</description>
          <addressOffset>0x0000009C</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXFUNCADDR3_ADDR</name>
              <description>Device Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBADDR3</name>
          <description>USB Receive Hub Address Endpoint 3</description>
          <addressOffset>0x0000009E</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBADDR3_ADDR</name>
              <description>Hub Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBPORT3</name>
          <description>USB Receive Hub Port Endpoint 3</description>
          <addressOffset>0x0000009F</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBPORT3_PORT</name>
              <description>Hub Port</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFUNCADDR4</name>
          <description>USB Transmit Functional Address Endpoint 4</description>
          <addressOffset>0x000000A0</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXFUNCADDR4_ADDR</name>
              <description>Device Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBADDR4</name>
          <description>USB Transmit Hub Address Endpoint 4</description>
          <addressOffset>0x000000A2</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBADDR4_ADDR</name>
              <description>Hub Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBPORT4</name>
          <description>USB Transmit Hub Port Endpoint 4</description>
          <addressOffset>0x000000A3</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBPORT4_PORT</name>
              <description>Hub Port</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFUNCADDR4</name>
          <description>USB Receive Functional Address Endpoint 4</description>
          <addressOffset>0x000000A4</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXFUNCADDR4_ADDR</name>
              <description>Device Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBADDR4</name>
          <description>USB Receive Hub Address Endpoint 4</description>
          <addressOffset>0x000000A6</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBADDR4_ADDR</name>
              <description>Hub Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBPORT4</name>
          <description>USB Receive Hub Port Endpoint 4</description>
          <addressOffset>0x000000A7</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBPORT4_PORT</name>
              <description>Hub Port</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFUNCADDR5</name>
          <description>USB Transmit Functional Address Endpoint 5</description>
          <addressOffset>0x000000A8</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXFUNCADDR5_ADDR</name>
              <description>Device Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBADDR5</name>
          <description>USB Transmit Hub Address Endpoint 5</description>
          <addressOffset>0x000000AA</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBADDR5_ADDR</name>
              <description>Hub Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBPORT5</name>
          <description>USB Transmit Hub Port Endpoint 5</description>
          <addressOffset>0x000000AB</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBPORT5_PORT</name>
              <description>Hub Port</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFUNCADDR5</name>
          <description>USB Receive Functional Address Endpoint 5</description>
          <addressOffset>0x000000AC</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXFUNCADDR5_ADDR</name>
              <description>Device Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBADDR5</name>
          <description>USB Receive Hub Address Endpoint 5</description>
          <addressOffset>0x000000AE</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBADDR5_ADDR</name>
              <description>Hub Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBPORT5</name>
          <description>USB Receive Hub Port Endpoint 5</description>
          <addressOffset>0x000000AF</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBPORT5_PORT</name>
              <description>Hub Port</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFUNCADDR6</name>
          <description>USB Transmit Functional Address Endpoint 6</description>
          <addressOffset>0x000000B0</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXFUNCADDR6_ADDR</name>
              <description>Device Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBADDR6</name>
          <description>USB Transmit Hub Address Endpoint 6</description>
          <addressOffset>0x000000B2</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBADDR6_ADDR</name>
              <description>Hub Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
